# !/usr/bin/python
# -*- coding:utf-8 -*-
# File        : 005 序列相加.py
# Author      : Simon
# Time        : 2020/10/10 15:03
# Description : 两种相同类型的序列相加操作，将两个序列进行连接，不会去除重复的元素，使用（+）运算符实现。
num1 = ['1','2','3','4']
num2 = ['5','6','7','8','9','10']
print(num1 + num2)

# 说明：在进行序列相加时，相同类型的序列是指同为列表、元组、集合等，序列中的元素类型可以不同。例如，下面的代码也是正确的：
num = [7,14,21,28,35,42,49,56]
nbm = ['怀特','起德','欧文','保罗','加索尔']
print(num + nbm)

'''但是不能将列表和元组相加，也不能将列表和字符串相加。例如，下面的代码是错误的：
num = [7,14,21,28,35]
print(num + '输出的数是7的倍数')
'''
